import React from "react";
import BackButton from "../../../components/Generic/BackButton/BackButton";

const TermsOfUseRU = () => {
  return (
    <div>
      {/* <h1>Условия использования</h1> */}
      <BackButton pageTitle={"Условия использования"} />
      <p>Последнее обновление: 11 мая 2025 г.</p>

      <p>
        whalepartners OÜ (регистрационный код 14674044, VAT № EE102141508),
        расположенная по адресу: Эстония, Харьюмаа, Таллинн, ул. Торнимяэ 5,
        10145 (далее – «Компания», «Мы»), настоящим предлагает неограниченному
        кругу лиц воспользоваться веб-сайтом www.wowdropbox.eu (далее – «Сайт»)
        и сопутствующими услугами на условиях настоящей публичной оферты –
        Условий использования (далее – «Условия»). Любое лицо, пользующееся
        Сайтом, регистрируя учетную запись или совершая покупку на Сайте,
        считается принявшим эти Условия и далее именуется «Пользователь» либо
        «Вы». Условия представляют собой юридически обязательный договор между
        Пользователем и Компанией. Просим внимательно прочитать Условия перед
        началом использования Сайта. Если Вы не согласны с каким-либо
        положением, пожалуйста, прекратите использование Сайта.
      </p>

      {/* --- */}
      <h2>Общие положения</h2>
      <h3>Доступ и акцепт.</h3>
      <p>
        Используя Сайт, Вы подтверждаете свое согласие с настоящими Условиями.
        Отдельные функциональности Сайта (например, регистрация аккаунта или
        оформление заказа) могут потребовать от Вас явного подтверждения
        согласия с Условиями (например, путем установки отметки «Согласен»). В
        любом случае факт использования Сайта означает полное принятие Вами
        настоящих Условий без каких-либо оговорок или ограничений.
      </p>

      <h3>Требования к Пользователю.</h3>
      <p>Принимая Условия, Вы удостоверяете, что:</p>
      <ul>
        <li>
          Вам исполнилось <strong>18 лет</strong>, и Вы обладаете полной право-
          и дееспособностью, необходимой для заключения данного соглашения;
        </li>
        <li>
          Вы используете Сайт добровольно и исключительно в личных,
          некоммерческих и развлекательных целях;
        </li>
        <li>
          вся информация, которую Вы предоставляете при регистрации и
          использовании Сайта (включая персональные данные, адрес доставки и
          платежные реквизиты), является точной, актуальной и полной, и Вы
          обязуетесь своевременно обновлять ее в случае изменений;
        </li>
        <li>
          использование Вами Сайта и приобретение Dropbox (далее – Dropbox или
          «коробка-сюрприз», виртуальная коробка с случайным содержимым) не
          нарушает законов, применимых к Вам. Вы обязуетесь самостоятельно
          соблюдать все соответствующие законы своей страны проживания или
          пребывания. Компания не несет ответственности, если использование
          Сайта противоречит требованиям законодательства Вашей юрисдикции;
        </li>
        <li>
          Вы будете соблюдать настоящие Условия и все применимые нормы
          законодательства при пользовании Сайтом.
        </li>
      </ul>

      <h3>Предмет услуг.</h3>
      <p>
        Компания предоставляет Пользователю онлайн-сервис для покупки
        виртуальных Dropbox, содержащих случайным образом определяемые товары
        или призы («Товары»). В состав услуг также входит обработка заказов,
        раскрытие (открытие) Dropbox, информирование Пользователя о выпавших
        товарах, а при необходимости – доставка выигранных физических товаров
        Пользователю. Каждый Dropbox гарантированно содержит товар(ы) реальной
        рыночной стоимостью не ниже цены приобретения данной коробки, т.е.
        Пользователь в любом случае получает эквивалентную или большую
        материальную ценность.
      </p>
      <p>
        Dropbox приобретаются за установленную цену в валюте евро (EUR) или иной
        валюте, указанной на Сайте, с использованием разрешенных способов
        оплаты. После оплаты Dropbox открывается, и Пользователь получает
        информацию о выпавшем призе (товаре). Все визуальные эффекты и анимации
        на Сайте при открытии Dropbox служат исключительно для удобства и
        развлечения Пользователя – фактический результат определяется заранее
        заложенным случайным алгоритмом. Внимание: изображения коробок и товаров
        на Сайте носят иллюстративный характер. Реальный полученный товар
        (включая его модель, комплектацию и упаковку) может незначительно
        отличаться от изображенного на экране.
      </p>

      <h3>Персональное и разрешенное использование.</h3>
      <p>
        Доступ к Сайту предоставляется Вам исключительно для личного
        использования. Запрещается использовать Сайт в коммерческих целях
        (например, для перепродажи товаров третьим лицам без согласия Компании)
        либо каким-либо образом, не предусмотренным настоящими Условиями. Все
        права, прямо не предоставленные Вам в отношении Сайта и его содержимого,
        сохраняются за Компанией.
      </p>

      <h3>Политика конфиденциальности.</h3>
      <p>
        Принимая настоящие Условия, Вы также соглашаетесь с условиями нашей
        Политики конфиденциальности, которая регулирует обработку персональных
        данных Пользователей. Политика конфиденциальности доступна по ссылке на
        Сайте. Пожалуйста, ознакомьтесь с ней, чтобы понять, как Компания
        собирает и использует Ваши персональные данные.
      </p>

      {/* --- */}
      <h2>Регистрация аккаунта</h2>
      <h3>Учетная запись.</h3>
      <p>
        Для доступа к полному функционалу Сайта, включая приобретение Dropbox,
        Пользователь может зарегистрировать личный аккаунт. При регистрации
        необходимо указать достоверный адрес электронной почты, придумать
        надежный пароль и предоставить иную запрашиваемую информацию (например,
        имя, страну проживания и т.п.). Один Пользователь имеет право
        зарегистрировать <strong>только одну</strong> учетную запись на Сайте.
        Запрещено создавать или использовать более одного аккаунта одному лицу,
        а также передавать или продавать свой аккаунт другим лицам. В случае
        обнаружения множественных аккаунтов, принадлежащих одному Пользователю,
        Компания вправе заблокировать или удалить все дублирующие аккаунты, а
        также аннулировать результаты (выигрыши), полученные с нарушением
        данного правила.
      </p>

      <h3>Конфиденциальность доступа.</h3>
      <p>
        Вы несете ответственность за сохранность конфиденциальности данных своей
        учетной записи, включая пароль. Не раскрывайте пароль третьим лицам. Все
        действия, совершенные с использованием Вашего логина и пароля, будут
        считаться совершенными Вами. Если Вы обнаружили или подозреваете
        несанкционированный доступ к своему аккаунту или утрату пароля, Вы
        обязаны незамедлительно уведомить об этом Компанию (например, через
        службу поддержки). До получения такого уведомления Компания вправе
        исходить из того, что доступ к аккаунту осуществляете лично Вы.
      </p>

      <h3>Актуальность данных.</h3>
      <p>
        Вы обязуетесь поддерживать актуальность информации своего аккаунта. В
        частности, адрес доставки должен быть действующим и полным, чтобы мы
        могли отправлять Вам физические товары. Компания не несет
        ответственности за последствия предоставления Пользователем неверных,
        устаревших или вводящих в заблуждение сведений.
      </p>

      <h3>Верификация и возраст.</h3>
      <p>
        Компания может в любое время запросить подтверждение Вашей личности и
        возраста (например, копию документа, удостоверяющего личность), особенно
        если возникли подозрения в нарушении Условий или законодательства
        (например, подозрение в том, что Пользователю нет 18 лет, либо
        подозрение в мошеннических действиях). В целях соблюдения требований
        законодательства (в том числе мер по противодействию мошенничеству и
        отмыванию денег) Вы соглашаетесь предоставить запрошенные данные и
        документы своевременно и в достоверном виде. Непредоставление
        необходимой информации может повлечь приостановление обслуживания или
        блокировку аккаунта до выяснения обстоятельств.
      </p>

      <h3>Приостановление и удаление аккаунта.</h3>
      <p>
        Компания оставляет за собой право при выявлении нарушений Пользователем
        настоящих Условий или требований закона заблокировать временно либо
        навсегда учетную запись такого Пользователя. В этом случае Компания
        уведомит Пользователя о принятой мере и, при возможности, о причинах.
        Если блокировка произошла по вине Пользователя (например, за запрещенные
        действия – см. раздел 7 ниже), Компания вправе аннулировать любые
        несостоявшиеся сделки Пользователя и отменить неотправленные
        призы/товары без компенсации стоимости Dropbox, приобретенных с
        нарушением. Пользователь не вправе требовать возмещения каких-либо
        убытков, связанных с правомерной блокировкой аккаунта за нарушение
        Условий.
      </p>

      <h3>Удаление аккаунта по инициативе Пользователя.</h3>
      <p>
        Вы вправе прекратить использование Сайта и запросить удаление своего
        аккаунта, обратившись в службу поддержки. Компания выполнит удаление
        (или анонимизацию) Ваших персональных данных и учетной записи в сроки,
        предусмотренные Политикой конфиденциальности, при условии отсутствия
        неурегулированных обязательств или незавершенных операций. Обратите
        внимание, что перед запросом на удаление аккаунта Вы должны обеспечить
        получение всех призов/товаров, которые были выиграны и еще не
        отправлены, либо письменно отказаться от них. Удаление аккаунта означает
        невозможность дальнейшего доступа к неоправленным товарам, оставшимся на
        аккаунте, и Компания не будет обязана их хранить или отправлять после
        удаления учетной записи.
      </p>

      {/* --- */}
      <h2>Оплата и процесс покупки Dropbox</h2>
      <h3>Оформление покупки.</h3>
      <p>
        Цены на доступные Dropbox указаны на Сайте в евро (EUR) либо иной
        валюте, явно обозначенной при выборе товара. Для покупки Dropbox
        Пользователь выбирает желаемую коробку и следует инструкциям для оплаты.
        Договор купли-продажи Dropbox между Пользователем и Компанией считается
        заключенным с момента подтверждения успешной оплаты со стороны
        Пользователя. После получения оплаты Компания предоставляет возможность
        немедленно открыть приобретенный Dropbox (виртуально раскрыть его
        содержимое). Одна покупка Dropbox дает право на получение одного приза
        (товара) либо набора товаров, определенных случайным образом в момент
        открытия.
      </p>

      <h3>Способы оплаты.</h3>
      <p>
        Оплата на Сайте производится с помощью доступных методов, перечисленных
        при оформлении заказа (например, банковские карты Visa/MasterCard,
        банковский перевод, электронные платежные системы и др.). Криптовалюты
        или внутренние виртуальные деньги не принимаются в качестве средства
        оплаты, если иное явно не указано на Сайте. При выборе способа оплаты
        Вам могут быть предложены условия и комиссии сторонних платежных
        провайдеров (банков, процессинговых компаний). Компания может привлечь
        стороннего платежного оператора для обработки транзакций; при этом
        ответственность за безопасность и своевременность проведения платежа
        частично лежит на таком операторе. Мы рекомендуем Вам ознакомиться с
        условиями обслуживания выбранного платежного метода.
      </p>

      <h3>Авторизация платежей.</h3>
      <p>
        Отправляя платежные данные, Вы подтверждаете, что обладаете законным
        правом использовать выбранное платежное средство (например, являетесь
        законным держателем банковской карты). При оплате может осуществляться
        аутентификация (например, ввод 3-D Secure кода). В случае если банк или
        платёжная система отказывает в авторизации транзакции, покупка Dropbox
        не будет осуществлена. Компания не несет ответственности за задержки или
        невозможность оплаты, связанные с работой платежных систем. Если оплата
        была произведена с ошибкой (например, списана неверная сумма) или Вы
        обнаружили несанкционированное списание, свяжитесь со службой поддержки
        для разбирательства.
      </p>

      <h3>Налоги и сборы.</h3>
      <p>
        Цены, указанные на Сайте, включают применимый налог на добавленную
        стоимость (НДС) либо другие аналогичные налоги, если это прямо указано.
        Однако в цену не включены возможные дополнительные сборы, не связанные
        напрямую с стоимостью товара, например таможенные пошлины, налоги при
        ввозе товара в Вашу страну, комиссии Вашего банка за обработку платежа и
        т.п. Пользователь самостоятельно несет ответственность за уплату всех
        налогов и сборов, связанных с совершением покупки и получением товара,
        за исключением тех, которые по закону обязана уплачивать Компания.
        Например, если Вы находитесь за пределами ЕС и при доставке товара
        возникают таможенные платежи в стране получения, Вы обязаны их оплатить
        непосредственно перевозчику или таможенным органам.
      </p>

      <h3>Момент открытия и списание средств.</h3>
      <p>
        Сразу после подтверждения успешной оплаты стоимость приобретенного
        Dropbox списывается (денежные средства поступают Компании), и для
        Пользователя запускается процесс открытия коробки на Сайте. Результат
        (выпавший приз/товар) определяется случайным образом генератором,
        встроенным в систему Сайта. Алгоритм распределения призов является
        случайным и справедливым (принцип Provably Fair): каждый из
        предусмотренных для данной коробки товаров выпадает пропорционально
        заданным вероятностям, без предвзятости. Компания гарантирует, что
        рыночная стоимость полученного приза не будет ниже цены Dropbox,
        оплаченной Пользователем. Если в ходе открытия Dropbox произошел
        технический сбой или отображена некорректная информация о выпавшем
        предмете (например, из-за ошибки интерфейса на экране показан неверный
        товар), то фактическим результатом считается тот товар, который был
        определен нашим алгоритмом случайного распределения на сервере. Мы
        сообщим Пользователю правильный результат в личном кабинете или по
        электронной почте. Пользователь не вправе требовать выдачи товара,
        ошибочно отображенного вследствие сбоя, если фактически данный товар не
        был выигран.
      </p>

      <h3>Отмена и отказ в обработке заказа.</h3>
      <p>
        Компания оставляет за собой право отказать в проведении транзакции или
        отменить покупку Dropbox до момента ее открытия в следующих случаях: (a)
        у Компании имеются основания полагать, что оплата была произведена
        мошенническим путем или с нарушением закона (например, с использованием
        украденной карты); (b) Пользователь нарушает настоящие Условия или
        попытался обойти технические ограничения Сайта; (c) произошел явный
        технический сбой на Сайте, повлиявший на корректность цены или процесса
        покупки. В случае отмены оплаченной покупки до открытия Dropbox
        Пользователю будет возвращена уплаченная сумма тем же способом, которым
        была получена (если иное не требуется для исполнения закона). Компания
        может запросить у Вас дополнительную информацию или подтверждение
        (например, подтверждение личности или права на карту) перед выполнением
        возврата, чтобы убедиться в законности запроса.
      </p>

      <h3>Подтверждение и документы.</h3>
      <p>
        Компания может выдавать электронные документы, подтверждающие покупку
        (такие как счет-фактура или кассовый чек в электронной форме,
        соответствующие требованиям законодательства Эстонии). Запрос на
        получение таких документов Вы можете направить в службу поддержки. Все
        финансовые операции проводятся в соответствии с действующим
        законодательством. При обнаружении подозрительных платежей Компания
        вправе приостановить предоставление услуг и провести проверку, а в
        случае выявления мошенничества – аннулировать соответствующие заказы и
        привлечь виновных к ответственности, включая передачу информации в
        правоохранительные органы.
      </p>

      {/* --- */}
      <h2>Доставка выигранных товаров</h2>
      <h3>Получение приза (товара).</h3>
      <p>
        После открытия Dropbox и определения выпавшего приза информация о призе
        отображается в личном кабинете Пользователя (раздел «инвентарь» или
        аналогичный). Если приз представляет собой физический товар,
        Пользователь имеет право запросить его доставку. Для этого Пользователю
        необходимо инициировать процедуру «выкупа» или отправки приза через
        интерфейс Сайта, указав актуальный почтовый адрес доставки и подтвердив
        оплату стоимости доставки (если она не бесплатна). Призы виртуального
        характера (например, цифровые коды, купоны и т.п., если таковые
        предлагаются) могут предоставляться прямо в электронном виде без
        физической доставки – такие призы считаются полученными сразу после
        открытия Box, и раздел 4.2–4.6 применим к ним только в части,
        относящейся к их предоставлению (не к доставке).
      </p>

      <h3>Стоимость доставки.</h3>
      <p>
        Стоимость доставки каждого физического товара рассчитывается и
        отображается Пользователю перед подтверждением отправки. Стоимость
        зависит от габаритов/веса товара, страны назначения и выбранного способа
        доставки (если есть варианты). В некоторых случаях Компания может
        предложить бесплатную доставку (например, при стоимости заказа выше
        определенной суммы или в рамках акции) – такие условия будут отдельно
        указаны на Сайте. Если бесплатная доставка не предусмотрена,
        Пользователь обязан оплатить указанные расходы на доставку прежде, чем
        товар будет отправлен. Оплата доставки осуществляется доступными
        способами аналогично оплате Dropbox.
      </p>

      <h3>Сроки отправки и доставки.</h3>
      <p>
        Компания прилагает усилия для как можно более быстрого отправления
        призов. Обычно отправка товара осуществляется в течение{" "}
        <strong>2–5 рабочих дней</strong> с момента получения от Пользователя
        всех необходимых данных для доставки и оплаты доставки (если применимо).
        Ориентировочные сроки доставки зависят от выбранного способа и адреса
        получателя: внутри Европейского союза доставка обычно занимает от{" "}
        <strong>5 до 15 рабочих дней</strong>. Доставка за пределы ЕС может
        занять более длительный срок (например, <strong>10–30 дней</strong>) с
        учетом таможенного оформления. Обратите внимание, что указанные сроки
        являются приблизительными. Фактическое время доставки может меняться
        ввиду факторов, не зависящих от Компании – загруженности
        почтовых/курьерских служб, праздничных периодов, форс-мажорных
        обстоятельств и пр. Компания не несет ответственности за задержки,
        вызванные силами, лежащими вне нашего контроля, однако обязуется
        уведомлять Пользователя о существенных задержках и прикладывать усилия к
        решению возникающих проблем.
      </p>

      <h3>Импортные пошлины и ограничения.</h3>
      <p>
        Если доставка осуществляется в страну, находящуюся за пределами
        Европейского союза, посылка может облагаться импортными пошлинами,
        налогами и/или иными сборами в стране назначения. Такие платежи не
        входят в цену Dropbox или стоимость доставки, рассчитываемую Компанией,
        и лежат на ответственности Получателя (Пользователя). Таможенные правила
        разных стран могут ограничивать ввоз определенных категорий товаров.
        Пользователь должен самостоятельно ознакомиться с законами своей страны
        относительно получения выигрышей/посылок из-за рубежа. Компания не несет
        ответственности за невозможность ввоза товара в страну Пользователя,
        если такой товар запрещен или ограничен к пересылке в данной юрисдикции.
        При необходимости Пользователь может перед выкупом приза уточнить у
        Компании, откуда будет отправлен товар, чтобы оценить потенциальные
        таможенные издержки.
      </p>

      <h3>Риск и право собственности.</h3>
      <p>
        Право собственности на физический товар переходит к Пользователю в
        момент передачи товара перевозчику для доставки на указанный
        Пользователем адрес. Однако риск случайной гибели или повреждения товара
        переходит к Пользователю только с момента фактического получения товара
        Пользователем (либо его уполномоченным представителем) по адресу
        доставки. Это означает, что Компания несет риск утраты или повреждения
        товара во время транспортировки до его вручения Пользователю. Если
        Пользователь самостоятельно выбирает перевозчика и способ доставки, не
        предложенный Компанией, и поручает Компании передать товар этому
        перевозчику, риск переходит к Пользователю в момент передачи товара
        выбранному им перевозчику.
      </p>

      <h3>Отслеживание и получение.</h3>
      <p>
        После отправки товара Компания, как правило, предоставляет Пользователю
        трекинг-номер или иную информацию для отслеживания доставки (если это
        предусмотрено выбранным сервисом доставки). Пользователь отвечает за то,
        чтобы вовремя получить/забрать отправленный товар. Если доставка
        осуществляется курьерской службой, убедитесь, что по адресу доставки
        кто-то сможет принять посылку. В случае почтовой доставки, если Вас не
        оказалось на месте, может быть оставлено уведомление о возможности
        повторной доставки или необходимости самостоятельно забрать посылку из
        отделения связи/пункта выдачи. Если Пользователь не предпримет
        необходимых действий для получения посылки (например, неоднократно будет
        отсутствовать по адресу доставки или не заберет посылку из отделения в
        установленные почтой сроки), и посылка будет возвращена отправителю,
        Компания свяжется с Пользователем для согласования повторной отправки.
        Повторная отправка может потребовать повторной оплаты доставки
        Пользователем (если первоначально доставка была платной), либо, по
        усмотрению Компании, стоимость повторной доставки может быть удержана из
        суммы, подлежащей возврату Пользователю. Если Компания не сможет
        связаться с Пользователем по предоставленным контактам в разумный срок
        либо Пользователь откажется от повторной доставки, Компания вправе
        аннулировать отправку. В таком случае договор купли-продажи
        соответствующего приза (товара) считается расторгнутым по инициативе
        Пользователя, и Компания возвратит Пользователю уплаченную за Box сумму
        за вычетом расходов на первоначальную доставку (если они не были
        оплачены отдельно) и иных понесенных Компанией расходов, связанных с
        несостоявшейся доставкой.
      </p>

      <h3>Отсутствие товара на складе (замена приза).</h3>
      <p>
        В редких случаях может возникнуть ситуация, когда объявленный приз
        (товар), который выпал Пользователю, не может быть отправлен. Такое
        возможно, например, если товар оказался временно отсутствующим на складе
        или снят с производства, либо выявлен заводской брак во всех доступных
        экземплярах, либо получен запрет на его продажу. В подобной ситуации
        Компания уведомит Пользователя как можно скорее и предложит один из
        вариантов решения проблемы по выбору Пользователя: (a) ожидание
        поступления товара и отсрочка доставки; (б) замену выигранного товара на
        другой аналогичный товар равной или большей стоимости (например, другого
        цвета или модели, либо эквивалентный по характеристикам товар той же
        ценовой категории); (в) отмену выигрыша с возвратом полной стоимости
        соответствующей Dropbox, оплаченной Пользователем. Пользователь вправе
        самостоятельно выбрать подходящий вариант из предложенных. Если
        Пользователь в разумный срок (например, в течение{" "}
        <strong>5 рабочих дней</strong>) не сообщит о своем выборе, Компания
        может по своему усмотрению либо отправить замену, максимально близкую по
        параметрам и стоимости к выигранному товару, либо осуществить возврат
        денежных средств за данный товар (Dropbox) на счет Пользователя.
        Предоставление замененного товара или возврат денег означает полное
        исполнение обязательств Компании по данному выигрышу; первоначально
        выигранный (но недоступный) товар в этом случае не подлежит
        предоставлению.
      </p>

      <h3>Утрата или повреждение при доставке.</h3>
      <p>
        Компания тщательно упаковывает отправляемые товары, однако в пути могут
        возникнуть непредвиденные обстоятельства. Если приз (товар) не был
        доставлен Пользователю по причине утраты отправления перевозчиком либо
        иного сбоя доставки, Пользователь должен уведомить об этом Компанию как
        можно скорее (например, по электронной почте{" "}
        <a href="mailto:info@wowdropbox.eu">info@wowdropbox.eu</a>), приложив
        информацию о заказе и, по возможности, подтверждение/доказательство
        недоставки (например, официальный статус отслеживания «утеряно» или
        справку почты об утере). Компания проведет расследование с участием
        транспортной службы. При подтверждении факта утраты отправления Компания
        предложит Пользователю выбор: повторная отправка такого же товара (если
        он имеется в наличии) за наш счет либо полный возврат денежных средств,
        уплаченных за соответствующую Dropbox и доставку. Если Пользователь не
        сможет предоставить запрошенную информацию, подтверждающую недоставку
        (например, по требованию – письменное заявление об отсутствии
        получения), и Компания не сможет удостовериться в факте утраты, возврат
        или повторная отправка могут быть не предоставлены.
      </p>

      <h3>Если товар пришел с браком или повреждением.</h3>
      <p>
        Мы стараемся обеспечить высокое качество и подлинность всех отправляемых
        призов. Если Вы получили товар, и он оказался дефектным, поврежденным в
        пути или не соответствующим описанию, пожалуйста, свяжитесь с нашей
        поддержкой в разумный срок (рекомендуется в течение{" "}
        <strong>48 часов</strong> с момента получения) и опишите проблему. К
        обращению желательно приложить фотографии полученного товара, на которых
        виден дефект или повреждение, а также упаковки (если она повреждена).
        После получения обращения Компания организует решение: в зависимости от
        характера проблемы Пользователю может быть предложен возврат товара и
        получение замены либо возврата денег. В случае подтверждения брака или
        повреждения Компания оплатит расходы по обратной пересылке товара
        обратно нам. Пользователь обязан бережно упаковать товар для возврата.
        После получения возвращенного дефектного товара Компания отправит замену
        (товар той же модели и комплектации, без дефектов) за свой счет либо
        вернет Пользователю полную стоимость Dropbox и первоначальной доставки.
        Выбор между заменой и возвратом средств определяется по согласованию с
        Пользователем с учетом наличия аналогичного товара. Если при проверке
        возвращенного товара Компания установит, что заявленный дефект
        отсутствует либо товар пришел в исправном виде, в возврате или замене
        может быть отказано; такой товар будет отправлен обратно Пользователю,
        при этом Пользователь должен будет оплатить связанные с повторной
        отправкой расходы.
      </p>

      <h3>Подлинность и гарантия товаров.</h3>
      <p>
        Компания гарантирует, что все физические товары, предлагаемое в качестве
        призов, являются оригинальными и подлинными, приобретенными у надежных
        поставщиков. Мы тщательно проверяем продукцию перед отправкой, чтобы
        убедиться в ее качестве и соответствии описанию. В отношении товаров
        действуют все предусмотренные законом гарантии и права потребителя. В
        частности, товары должны соответствовать описанию и не иметь скрытых
        недостатков. Если впоследствии обнаружится производственный дефект
        товара (не связанный с обычным износом или неправильным использованием)
        в течение установленного законодательством гарантийного срока (например,
        в течение <strong>2 лет</strong> со дня получения для товаров
        длительного пользования в странах ЕС), Пользователь вправе обратиться к
        Компании с претензией. Мы рассмотрим такую претензию и, при
        обоснованности, обеспечим законодательно предусмотренные меры – ремонт,
        замену или возврат уплаченной суммы в установленные сроки. Ничто в
        настоящих Условиях не ограничивает ваши неотъемлемые права потребителя,
        предусмотренные законодательством (в том числе права по гарантии
        качества товара).
      </p>

      <div>
        <p>
          и его предполагаемой продолжительности. Если действие форс-мажора
          продолжается более <strong>30 дней подряд</strong> и существенно
          препятствует выполнению обязательств, каждая из сторон вправе
          расторгнуть договор, уведомив об этом другую сторону. При расторжении
          договора в связи с форс-мажором Пользователю возвращаются оплаченные
          им денежные средства за неполученные услуги (например, за оплаченный,
          но не отправленный товар), за вычетом расходов, уже понесенных
          Компанией к моменту расторжения.
        </p>

        <h3>Особые оговорки.</h3>
        <p>
          Ничто в настоящих Условиях не исключает и не ограничивает
          ответственность Компании: (a) за причинение вреда жизни или здоровью
          по вине Компании; (b) за грубую неосторожность или умышленные
          действия, причинившие ущерб Пользователю; (c) за мошенничество или
          умышленный обман со стороны Компании; а также (d) любые иные случаи, в
          которых по закону ответственность не может быть ограничена или
          исключена договором. Также никакие положения Условий не должны
          толковаться как ограничивающие установленные законом права потребителя
          – все такие права сохраняются в полном объеме и дополняются
          положениями настоящего соглашения.
        </p>

        {/* --- */}
        <h2>Применимое право и разрешение споров</h2>
        <h3>Применимое право.</h3>
        <p>
          Настоящие Условия и возникающие из них отношения между Пользователем и
          Компанией регулируются законодательством{" "}
          <strong>Эстонской Республики</strong>. Если Пользователь приобретает
          услуги в качестве потребителя, проживающего на территории Европейского
          союза, такие обязательственные отношения могут попадать под
          императивные нормы права страны проживания потребителя (например, по
          защите прав потребителей), которые имеют приоритет над избранным
          правом. Ничто в настоящих Условиях не снижает уровень защиты прав
          потребителя, гарантированный такими императивными нормами.
        </p>

        <h3>Переговоры и претензионный порядок.</h3>
        <p>
          В случае возникновения любого спора, требования или разногласия,
          связанных с настоящими Условиями или использованием Сайта,
          Пользователь в первую очередь должен обратиться в службу поддержки
          Компании (по адресу{" "}
          <a href="mailto:info@wowdropbox.eu">info@wowdropbox.eu</a> или через
          интерфейс Сайта) с описанием проблемы и своих требований. Компания
          постарается ответить и урегулировать претензию в разумный срок (обычно
          ответ предоставляется в течение <strong>5–14 рабочих дней</strong>).
          Стороны приложат добросовестные усилия для разрешения споров путем
          переговоров.
        </p>

        <h3>Разрешение спора в судебном порядке.</h3>
        <p>
          Если спор не удалось урегулировать мирным путем, он подлежит
          рассмотрению в судебных инстанциях согласно применимому праву. При
          отсутствии иного соглашения сторон, любой спор между Компанией и
          Пользователем, вытекающий из настоящих Условий, подлежит рассмотрению
          в компетентном суде <strong>Эстонии</strong>. Если Пользователь
          обладает статусом потребителя и проживает на территории ЕС, он вправе,
          помимо суда в Эстонии, предъявить иск против Компании в суде по месту
          своего жительства, как это предусматривает Регламент (ЕС) №1215/2012
          (Брюссель I) или иные применимые нормы международного частного права.
          В случае спора с потребителем Компания обязуется участвовать в
          процессе в той юрисдикции, которую выберет потребитель согласно
          закону.
        </p>

        <h3>Онлайн-платформа урегулирования споров.</h3>
        <p>
          Согласно законодательству ЕС, Компания сообщает Пользователям о
          возможности использования платформы Онлайн-разрешения споров (ODR),
          созданной Европейской Комиссией. Платформа доступна по адресу:{" "}
          <a
            href="https://ec.europa.eu/consumers/odr"
            target="_blank"
            rel="noopener noreferrer"
          >
            https://ec.europa.eu/consumers/odr
          </a>
          . Через нее потребитель может подать жалобу и попытаться урегулировать
          спор с продавцом онлайн. Обращаем внимание, что использование данной
          платформы является правом, а не обязанностью потребителя. Компания, со
          своей стороны, открыта к участию в процедурах альтернативного
          урегулирования споров, однако конкретное решение о применении ADR
          будет приниматься в каждом случае отдельно. Настоящим Компания
          уведомляет, что не является обязанной по закону участвовать в
          процедурах альтернативного разрешения споров, кроме как в случаях,
          когда такое участие является обязательным в силу нормативных актов.
        </p>

        {/* --- */}
        <h2>Прочие условия</h2>
        <h3>Изменение Условий.</h3>
        <p>
          Компания вправе время от времени вносить изменения в настоящие Условия
          в одностороннем порядке, особенно в случае изменения функционала
          Сайта, в целях соблюдения новых требований законодательства или при
          изменении деловой практики. В случае внесения изменений новая редакция
          Условий публикуется на Сайте и помечается датой последнего обновления
          (см. верхнюю часть документа). Мы также можем уведомить
          зарегистрированных Пользователей о существенных изменениях посредством
          электронного сообщения (e-mail) и/или через уведомление на самом
          Сайте. Обязанность Пользователя – периодически просматривать настоящие
          Условия на предмет изменений. В случае несогласия с новой редакцией
          Условий Пользователь должен прекратить использование Сайта и, при
          наличии зарегистрированного аккаунта, вправе запросить его удаление
          (при условии выполнения всех незавершенных обязательств). Если после
          даты вступления в силу обновленных Условий Пользователь продолжает
          использовать Сайт (например, совершает новые покупки), это означает
          согласие с изменениями и принятие новой редакции в полном объеме.
        </p>

        <h3>Передача прав и обязанностей.</h3>
        <p>
          Компания может передать (уступить) свои права и обязанности по
          настоящим Условиям третьему лицу (например, в случае реорганизации
          бизнеса, уступки требований банку или иному партнеру) при условии
          соблюдения прав Пользователя, предусмотренных Условиями. Такое
          правопреемство не требует согласия Пользователя, но Пользователь будет
          надлежащим образом уведомлен, если затрагиваются существенные условия
          обслуживания. Пользователь не вправе передавать свои права и
          обязанности по настоящим Условиям третьим лицам без предварительного
          письменного согласия Компании. Это означает, в частности, запрет на
          переуступку права требования доставки приза другому лицу, передачу
          аккаунта и иных прав по договору.
        </p>

        <h3>Недействительность положений.</h3>
        <p>
          Если какое-либо из положений настоящих Условий будет признано
          незаконным, недействительным или неисполнимым в установленном порядке
          (например, судом или компетентным органом), это положение считается
          отделимым от остальных положений Условий и не влияет на
          действительность и применимость остальных частей соглашения. Стороны в
          таком случае заменят недействительное условие другим, юридически
          корректным положением, максимально близким по смыслу и достигаемым
          целям к первоначальному.
        </p>

        <h3>Полнота соглашения.</h3>
        <p>
          Настоящие Условия (включая упомянутые в них политики и документы,
          которые инкорпорированы посредством ссылки, например Политику
          конфиденциальности) содержат полный и исчерпывающий договор между
          Пользователем и Компанией относительно использования данного Сайта и
          предлагаемого сервиса Dropbox. Все предыдущие договоренности,
          переговоры, переписка и соглашения между сторонами относительно
          данного предмета теряют силу с момента принятия Пользователем данных
          Условий. В случае противоречия между настоящими Условиями и любой
          публичной информацией на Сайте (например, рекламными материалами, FAQ
          и пр.), преимущество имеют Условия.
        </p>

        <h3>Отказ от права (неприменение условий).</h3>
        <p>
          Несостоявшееся или задержавшееся осуществление любой из Сторон
          какого-либо права или требования по настоящим Условиям не означает
          отказа от такого права или требования в будущем. Если Компания не
          применила какое-либо положение Условий в конкретном случае, это не
          означает отказа от возможности применить его в случае повторного
          нарушения или в любой другой ситуации. Любой отказ от права или
          условия будет действителен только в том случае, если он совершен в
          письменной форме и подписан надлежащим образом уполномоченным
          представителем соответствующей Стороны.
        </p>

        <h3>Контактные данные.</h3>
        <p>
          Если у Вас возникли вопросы относительно настоящих Условий или
          необходимо отправить нам какое-либо уведомление в рамках договора, Вы
          можете связаться с нами по электронной почте{" "}
          <a href="mailto:info@wowdropbox.eu">info@wowdropbox.eu</a>.
          Официальный почтовый адрес Компании для корреспонденции: whalepartners
          OÜ, Эстония, 10145, г. Таллинн, ул. Торнимяэ 5. Мы также можем
          связываться с Вами посредством электронной почты, отправляя сообщения
          на адрес, указанный в Вашем аккаунте, либо через размещение
          уведомлений на Сайте (в личном кабинете или соответствующем разделе).
          Пользователь считается получившим сообщение от Компании в день
          отправки электронного письма либо на следующий день после размещения
          уведомления на Сайте.
        </p>

        <h3>Языки и перевод.</h3>
        <p>
          Настоящие Условия предоставлены Пользователю на русском языке для
          удобства восприятия. В случае, если Компания предоставит официальный
          перевод Условий на другие языки, версия на русском языке продолжает
          иметь юридическую силу для русскоязычных пользователей. В случае
          обнаружения расхождений между русскоязычной версией Условий и их
          переводом, приоритет имеет версия, опубликованная на русском языке
          (либо иная версия, которую Компания специально обозначит в качестве
          официальной).
        </p>

        <p>
          Спасибо за внимание. Используя наш Сайт, Вы подтверждаете, что
          ознакомились с настоящими Условиями и соглашаетесь соблюдать их.
          Желаем удачи и приятного использования сервиса wowdropbox! Если у Вас
          возникнут какие-либо вопросы, наша команда поддержки всегда готова
          помочь.
        </p>
      </div>
    </div>
  );
};

export default TermsOfUseRU;
